# NoAutoRouteSolutionFoundWarning Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AutoRouteFailures..::..NoAutoRouteSolutionFoundWarning Property
BuiltInFailures..::..AutoRouteFailures Class See Also
---
No auto-route solution was found.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoAutoRouteSolutionFoundWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoAutoRouteSolutionFoundWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoAutoRouteSolutionFoundWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AutoRouteFailures Class
Autodesk.Revit.DB Namespace